app/views/institutions/show.html.erb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."institution_id" = $1  [["institution_id", 2]]
---
            <h3>Instructores</h3>
            <% if @institution.instructors.any? %>