app/views/employees/_form.html.erb

SELECT "work_structures".* FROM "work_structures"
---
                  <%= f.select(:work_structure_id) do %>
                    <% WorkStructure.all.each do |a| -%>