app/views/employees/_form.html.erb

SELECT "work_structures"."department", "work_structures"."id" FROM "work_structures"
---
                  <%= f.label :work_structure_id, "Puesto" %>
                  <%= f.select(:work_structure_id, options_for_select(WorkStructure.all.pluck(:department, :id)))%>